Repository: jsc-masshtab/vdi-server
Catalog: backend/common/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: INFO message from VeiL Broker.
ru: Информационное сообщение с VeiL VDI брокера.

source: Warning message from VeiL Broker.
ru: Сообщение о предупреждении на VeiL VDI брокера.

source: Error message from VeiL Broker.
ru: Сообщение об ошибке на VeiL VDI брокера.

source: SMTP server is not configured.
ru: SMTP сервер не настроен.

source: Error in smtp server: {}.
ru: Ошибка связанная с SMTP сервером: {}.

source: Add new journal archive.
ru: Добавлен новый архив журнала.

source: Archive name:
ru: Имя архива:

source: path:
ru: путь:

source: User {} connected to VM {}.
ru: Пользователь {} подключился к ВМ {}.

source: User {} disconnected from VM {}.
ru: Пользователь {} отключился от ВМ {}.

source: User {} failed to connect to VM {}.
ru: Пользователю {} не удалось подключиться к ВМ {}.

source: Error code: {}. Error message: {}.
ru: Код ошибки: {}. Сообщение об ошибке: {}.

source: username can`t be empty.
ru: имя пользователя не может быть пустым.

source: username must be <= 128 characters.
ru: имя пользователя должно быть <= 128 символов.

source: username {} must contain letters, digits, _, +, begin from letter and can't contain any spaces.
ru: имя пользователя {} должно состоять из букв, цифр, _, +, начинаться с буквы и не содержать пробелов.

source: Role {} is added to user {}.
ru: Роль {} назначена пользователю {}.

source: User {} roles: {}.
ru: Роли пользователя {}: {}.

source: Role {} is assigned to user {}.
ru: Роль {} назначена пользователю {}.

source: Roles: {} was deleted to user {}.
ru: Роли: {} удалены у пользователя {}.

source: User {} already has permission {}.
ru: Пользователь {} уже имеет разрешение.

source: Permission(s) {} added to user {}.
ru: Разрешения {} назначены пользователю {}.

source: Permission(s) {} removed from user {}.
ru: Разрешения {} удалены у пользователя {}.

source: User {} permission(s): {}.
ru: Разрешения пользователя {}: {}.

source: User {username} has been activated.
ru: Пользователь {username} активирован.

source: User {username} has been activated on Astra.
ru: Пользователь {username} был активирован в системе.

source: There is no more active superuser.
ru: Больше нет активного администратора.

source: User {username} has been deactivated.
ru: Пользователь {username} деактивирован.

source: User {username} has been deactivated on Astra.
ru: Пользователь {username} деактивирован в системе.

source: Invalid credentials. Check or create password for user {}.
ru: Неверные учетные данные. Проверьте или создайте пароль для пользователя {}.

source: Password of user {username} has been changed.
ru: Пароль пользователя {username} изменен.

source: Password of user {username} has`t been changed.
ru: Пароль пользователя {username} не был изменен.

source: Password of user {} has been changed to the local password.
ru: Пароль пользователя {} изменен на локальный пароль.

source: Local user {username} was converted to domain user.
ru: Локальный пользователь {username} был преобразован в доменного пользователя.

source: Superuser.
ru: Администратор.

source: User.
ru: Пользователь.

source: You must change password for user {}. Check a reason in description.
ru: Необходимо изменить пароль для пользователя {}. Причина в описании.

source: User {} was created in Astra Linux before. Please try to create him with correct password or delete in Astra Linux before trying to create in VeiL VDI again.
ru: Пользователь {} был ранее создан в Astra Linux. Пожалуйста, попробуйте создать его с правильным паролем или удалите его в Astra Linux, прежде чем снова пытаться создать в VeiL VDI.

source: User {} was created in Astra Linux before. Please delete him there before trying to create in Broker again.
ru: Пользователь {} был ранее создан в Astra Linux. Пожалуйста удалите его оттуда, прежде чем снова пересоздать в Брокере.

source: User {} creation error.
ru: Ошибка создания пользователя {}.

source: Your password is incorrect for user {}. Check description in journal.
ru: Пароль неверен для пользователя {}. Проверьте описание в журнале.

source: {} {} created.
ru: {} {} создан.

source: User {} update error.
ru: Ошибка обновления пользователя {}.

source: Values of user {} is changed.
ru: Параметры пользователя {} изменены.

source: Roles: {}.
ru: Роли: {}.

source: User {username} has become a superuser.
ru: Пользователь {username} стал администратором.

source: User {username} is no longer a superuser.
ru: Пользователь {username} перестал быть администратором.

source: User {username} has been logged in.
ru: Пользователь {username} вошел в систему.

source: Auth type: {}, IP: {}, Client type: {}.
ru: Тип авторизации: {}, IP: {}, тип клиента: {}.

source: User {username} has been logged out.
ru: Пользователь {username} вышел из системы.

source: QR code and secret code of 2fa were repeated for user {}.
ru: QR код и секретный код для двухфакторной аутентификации были повторены для пользователя {}.

source: New QR code and secret code of 2fa were generated for user {}.
ru: Новый QR код и секретный код для двухфакторной аутентификации были созданы для пользователя {}.

source: One-time password does not match or is out of date.
ru: Одноразовый пароль не совпадает или устарел.

source: Group {} is created.
ru: Группа {} создана.

source: Group {} already has permission {}.
ru: Группа {} уже имеет разрешение {}.

source: Permission(s) {} added to group {}.
ru: Разрешения: {} добавлены группе {}.

source: Permission(s) {} removed from group {}.
ru: Разрешения {} удалены у группы {}.

source: Group {} permission(s): {}.
ru: Разрешения группы {}: {}.

source: Values of group {} is updated.
ru: Параметры группы {} обновлены.

source: User {} has been included to group {}.
ru: Пользователь {} был включен в группу {}.

source: User {} is already in group {}.
ru: Пользователь {} уже находится в группе {}.

source: Removing user {} from group {}.
ru: Удаление пользователя {} из группы {}.

source: Role {} has been set to group {}.
ru: Роль {} добавлена в группу {}.

source: Group {} has already role {}.
ru: Группе {} уже назначена роль {}.

source: Roles: {} was deleted to group {}.
ru: Роли: {} удалены из группы {}.

source: More than one authentication directory can not be created.
ru: Не может быть создано более одной службы каталогов.

source: Authentication directory {} is created.
ru: Служба каталогов {} создана.

source: Values for auth directory is updated.
ru: Значения службы каталогов обновлены.

source: Arguments: {} of group: {}.
ru: Аргументы: {} группы: {}.

source: Mapping for auth directory {} is created.
ru: Сопоставление для службы каталогов {} создано.

source: New arguments: {} of group: {}.
ru: Новые аргументы: {} группы: {}.

source: Mapping for auth directory {} is updated.
ru: Сопоставление для службы каталогов {} обновлено.

source: Failed to connect to authentication directory server {}.
ru: Не удалось подключиться к серверу службы каталогов LDAP {}.

source: Authentication directory server {} is connected.
ru: Сервер службы каталогов {} подключен.

source: Username must be a string.
ru: Имя пользователя должно быть строкой.

source: Username {} is incorrect. Maybe you mean {}.
ru: Имя пользователя {} неверное. Может быть вы имели в виду {}.

source: Username {username} is incorrect.
ru: Имя пользователя {username} неверное.

source: User {} is deactivate.
ru: Пользователь {} деактивирован.

source: Mappings: {}.
ru: Сопоставления: {}.

source: escaped values: {}.
ru: скрытые значения: {}.

source: role mapping value type: {}.
ru: тип значений отображения роли: {}.

source: User VeiL groups: {}.
ru: Группы пользователей VeiL: {}.

source: Attaching user {} to group: {}.
ru: Прикрепление пользователя {} к группе {}.

source: No authentication directory controllers.
ru: Нет контроллеров служб каталогов.

source: Invalid credentials.
ru: Неверные учетные данные.

source: LDAP auth timeout.
ru: Тайм-аут аутентификации LDAP

source: Invalid credentials (ldap): {}.
ru: Неверные учетные данные (ldap): {}.

source: Server down (ldap).
ru: Сервер не отвечает (ldap).

source: The LDAP server provides an alternate address to which an LDAP request can be processed, but the attempt was unsuccessful.
ru: Сервер LDAP предоставляет альтернативный адрес, по которому может быть обработан запрос LDAP, но попытка было неудачной.

source: Invalid credentials (ldap Referral): {}.
ru: Неверные учетные данные (ldap Referral): {}.

source: Referral server is down (ldap).
ru: Referral сервер не отвечает (ldap).

source: LDAP username and password can`t be empty.
ru: Имя пользователя и пароль LDAP не могут быть пустыми.

source: Authentication directory server {} has bad auth info.
ru: Не удалось подключиться к серверу службы каталогов {}.

source: Fail to connect to Authentication Directory. Check service information.
ru: Ошибка подключения к службе каталогов.

source: {} new users synced from Authentication Directory.
ru: {} новых пользователей синхронизировано из службы каталогов.

source: No such Group.
ru: Отсутствует такая группа.

source: Group {} is not synchronized by AD.
ru: Группа {} не синхронизирована со службой каталогов.

source: There is no users to sync in group {group.verbose_name}.
ru: В группе {group.verbose_name} не найдены пользователи для синхронизации.

source: Controller {} has no api client.
ru: Контроллер {} не имеет подключения к ECP VeiL.

source: ECP VeiL version could not be obtained. Check your token.
ru: Не удается получить версию ECP VeiL. Проверьте свой токен.

source: ECP VeiL version should be 4.3 or higher. Current version is incompatible.
ru: Версия ECP VeiL должна быть 4.3 или выше. Текущая версия не поддерживается.

source: Controller {} added.
ru: Контроллер {} добавлен.

source: Controller {} has been successfully updated.
ru: Контроллер {} успешно обновлен.

source: Controller {} update failed.
ru: Ошибка обновления контроллера {}.

source: Controller {} has been removed.
ru: Контроллер {} удалён.

source: Controller {} has been activated.
ru: Контроллер {} активирован.

source: Controller {} status has been switched to {}.
ru: Статус контроллера {} изменен на {}.

source: No such controller.
ru: Нет такого контроллера.

source: Journal in this period is empty.
ru: Журнал для этого периода пуст.

source: Path {} is incorrect.
ru: Неверный путь: {}.

source: Check date. Interval {} - {} is incorrect.
ru: Проверьте дату. Некорректный промежуток {} - {}.

source: Not enough free space.
ru: Недостаточно свободного места.

source: Journal export error.
ru: Ошибка экспорта журнала.

source: Choose right period.
ru: Выберите правильный период.

source: Count must be more than 1.
ru: Количество должно быть больше 1.

source: Journal settings changed.
ru: Настройки журнала изменены.

source: Valid license key is uploaded.
ru: Лицензионный ключ загружен.

source: OS error.
ru: Системная ошибка.

source: Wrong Licence file format.
ru: Неверный формат файла лицензии.

source: Incorrect sorting option {}.
ru: Неверный параметр сортировки {}.

source: Pool {} has been updated.
ru: Пул {} обновлен.

source: User {} has been included to pool {}.
ru: Пользователь {} был включен в пул {}.

source: {} already has permission.
ru: {} уже имеет разрешение.

source: Removing user {} from pool {}.
ru: Удаление пользователя {} из пула {}.

source: User {} has no direct right to pool {}.
ru: У пользователя {} нет прямых прав на пул {}. Пропускаем.

source: Group {} has been included to pool {}.
ru: Группа {} включена в пул {}.

source: Pool already has permission.
ru: Пул уже имеет разрешение.

source: Removing group {} from pool {}.
ru: Удаление группы {} из пула {}.

source: Controller {} not found.
ru: Контроллер {} не найден.

source: Delete VMs for GuestPool {}.
ru: Удаление виртуальных машин для гостевого пула {}.

source: Delete VMs for AutomatedPool {}.
ru: Удаление виртуальных машин для автоматического пула {}.

source: VM {} has been removed from ECP VeiL.
ru: ВМ {} удалена из ECP VeiL.

source: Complete removal pool of desktops {verbose_name} is done.
ru: Выполнено полное удаление пула рабочих столов {verbose_name}.

source: Pool {} has been activated.
ru: Пул {} активирован.

source: Pool {} status changed to {}.
ru: Статус пула {} изменен на {}.

source: The sort parameter is incorrect.
ru: Неверный параметр сортировки.

source: List of VM should not be empty.
ru: Список виртуальных машин не должен быть пустым.

source: VM doesn't belong to specified pool.
ru: Виртуальная машина не принадлежит заданному пулу.

source: VM {} has been removed from the pool {} and ECP VeiL.
ru: ВМ {} удалена из пула {} и из ECP VeiL.

source: VM {} has been removed from the pool {}.
ru: ВМ {} удалена из пула {}.

source: Tag {name} created for pool {name}.
ru: Тэг {name} добавлен к пулу {name}.

source: Tag {} removed from ECP VeiL.
ru: Тэг {} удален из ECP VeiL.

source: Tag {name} updated for pool {name} and all vms in pool.
ru: Тэг {name} обновлен для пула {name} и всех ВМ в пуле.

source: Tag {} removed from VM {}.
ru: Тэг {} удален для ВМ {}.

source: Tag {} added to VM {}.
ru: Тэг {} назначен ВМ {}.

source: RDS pool {} created.
ru: Пул приложений {} создан.

source: VM {} created.
ru: ВМ {} создана.

source: VM {} created and added to the pool {}.
ru: ВМ {} создана и добавлена в пул {}.

source: Static pool {} created.
ru: Статический пул {} создан.

source: Initial_size: {}, total_size: {}, increase_step {}, reserve_size {}.
ru: Начальный размер: {}, Максимальный размер: {}, Шаг расширения: {}, Резервный размер: {}.

source: GuestPool {} is created.
ru: Создан гостевой пул {}.

source: AutomatedPool {} is created.
ru: Создан автоматический пул {}.

source: Update Pool {} values.
ru: Обновление значений пула {}.

source: There is no client for pool {}.
ru: Пул {} не имеет подключения к ECP VeiL. Проверьте контроллер.

source: VM creation task {} finished with error.
ru: Задача {} создания ВМ завершилась с ошибкой.

source: Fail to cancel VM creation task.
ru: Ошибка отмены задачи создания ВМ.

source: VM creation error.
ru: Ошибка создания ВМ.

source: {} vm(s) are successfully added in the {} pool.
ru: {} ВМ успешно добавлены в пул {}.

source: Adding VM to the pool {} finished with errors.
ru: Добавление ВМ в пул {} закончилось с ошибками.

source: Required: {}, created: {}.
ru: Необходимо: {}, создано: {}.

source: VM preparation error.
ru: Ошибка подготовки ВМ.

source: Settings changed.
ru: Настройки изменены.

source: Smtp settings are changed.
ru: Настройки SMTP сервера изменены.

source: Create VM {} on VDI DB.
ru: Создание виртуальной машины {} на VDI DB.

source: VM has no api client.
ru: ВМ не имеет клиента. Проверьте состояние контроллера.

source: Failed to create multi-delete task.
ru: Не удалось создать задачу множественного удаления.

source: VM deletion task {} finished with error.
ru: Задача {} удаления ВМ завершилась с ошибкой.

source: VM multi-deletion task finished with error. Please see task details on VeiL ECP.
ru: Задача множественного удаления ВМ завершена с ошибкой. Пожалуйста посмотрите детали задачи на VeiL ECP.

source: VMs: {}.
ru: ВМ: {}.

source: VM {} removed from ECP.
ru: ВМ {} удалена из ECP.

source: VM {} deletion task finished with error.
ru: Задача удаления ВМ {} завершилась с ошибкой.

source: User {} has been included to VM {}.
ru: За пользователем {} закреплена ВМ {}.

source: VM {} is clear from {} users.
ru: ВМ {} освобождена от {} пользователя(-ей).

source: VM {} is clear from users.
ru: ВМ {} освобождена от пользователей.

source: There is no client for controller {}.
ru: Контролер {} не имеет подключения к ECP VeiL.

source: Not enough free space on data pool.
ru: Недостаточно свободного места в пуле данных.

source: Failed to create VM. Error code: {create_response.error_code} Wait before next try.
ru: Не удалось создать ВМ. Код ошибки: {create_response.error_code} Подождите перед следующей попыткой.

source: VM {} deleting cancelled by timeout.
ru: Удаление ВМ {} отменено по таймауту.

source: VM multi-deletion task cancelled by timeout. Please see task details on VeiL ECP.
ru: Задача множественного удаления ВМ отменена по истечении времени ожидания. Пожалуйста посмотрите детали задачи на VeiL ECP.

source: Error occurred during deleting Computers from Authentication Directory
ru: Возникла ошибка во время удаления Computers из АД.

source: No such event.
ru: Нет такого события.

source: Remote task finished with error. Check ECP VeiL.
ru: Удаленная задача завершена с ошибкой. Проверьте ECP VeiL.

source: VM {} is powered.
ru: ВМ {} включена.

source: VM can`t be powered on or already powered.
ru: ВМ не включается или уже включена.

source: VM {} already shutdown.
ru: ВМ {} уже выключена.

source: VM {} is force shutdown.
ru: ВМ {} принудительно выключена.

source: VM {} is shutdown.
ru: ВМ {} выключена.

source: VM {} is shutdown. Please power this.
ru: ВМ {} выключена. Пожалуйста включите её.

source: VM {} was force reboot.
ru: ВМ {} принудительно перезагружена.

source: VM {} was reboot.
ru: ВМ {} перезагружена.

source: VM {} is suspended.
ru: ВМ {} приостановлена.

source: Forbid create backup from a thin clone: {}.
ru: Запрещено создание резервной копии от тонкого клона: {}.

source: Creating backup finished with error.
ru: Создание резервной копии завершилось с ошибкой.

source: Backup for VM {} is created.
ru: Создана резервная копия для ВМ {}.

source: Total size of pool {} increased.
ru: Увеличен максимальный размер пула {}.

source: VM {} has been added to the pool {}.
ru: ВМ {} добавлена в пул {}.

source: Backup restore finished with error.
ru: Восстановление из резервной копии завершилось с ошибкой.

source: Backup from VM {} restored to pool {} as {}.
ru: Резервная копия для ВМ {} восстановлена в пул {} с именем {}.

source: VM {} remote access enabled.
ru: Удаленный доступ ВМ {} включен.

source: Waiting Qemu guest agent for vm {}.
ru: Ожидание ответа Гостевого агента для ВМ {}.

source: VM {} hostname setting task failed.
ru: Ошибка задания hostname ВМ {}.

source: VM {} hostname setting success.
ru: ВМ {} успешно задан hostname.

source: VM {} has been prepared.
ru: ВМ {} подготовлена.

source: VM preparation task finished with errors. Check ECP Veil.
ru: Задача подготовки ВМ завершена с ошибкой. Проверьте ECP VeiL.

source: ECP Veil failed to prepare VM.
ru: Не удалось подготовить ВМ на ECP VeiL.

source: {} preparation cancelled by timeout.
ru: подготовка {} отменена по таймауту.

source: VM {} preparation error.
ru: Ошибка подготовки ВМ {}.

source: Vm connection data for VM {vm.verbose_name} and connection type {connection_type} added
ru: Данные подключения для ВМ {vm.verbose_name} и типа подключения {connection_type} добавлены

source: Vm connection data for VM {vm.verbose_name} and connection type {self.connection_type} updated
ru: Данные подключения для ВМ {vm.verbose_name} и типа подключения {self.connection_type} обновлены

source: Vm connection data for VM {vm.verbose_name} and connection type {self.connection_type} deleted
ru: Данные подключения для ВМ {vm.verbose_name} и типа подключения {self.connection_type} удалены

source: Token expired.
ru: Срок действия токена истек.

source: Token invalid.
ru: Недействительный токен.

source: Error with JWT decode.
ru: Ошибка JWT декодирования.

source: Invalid authorization header.
ru: Неправильный заголовок авторизации.

source: Missing authorization header.
ru: Пропущен заголовок авторизации.

source: User {} not found.
ru: Пользователь {} не найден.

source: Can`t find VM {} on VeiL ECP.
ru: Не удалось найти ВМ {} на VeiL ECP.

source: Can`t find Tag {} on VeiL ECP.
ru: Не удалось найти Тег {} на VeiL ECP.

source: VeiL ECP {} request error.
ru: Ошибка запроса ECP VeiL {}.

source: Invalid permissions.
ru: Недостаточно прав.

source: IP: {}. username: {}.
ru: IP: {}. Пользователь: {}.

source: Unable to logon to system using these credentials.
ru: Не удалось войти в систему с предоставленными учетными данными.

source: 401: Unauthorized.
ru: Ошибка 401: проблема с авторизацией.

source: Incorrect sort parameter {}.
ru: Неверный параметр сортировки {}.

source: Incorrect request parameter {}.
ru: Неверный параметр запроса {}.

source: {} {} has been disabled.
ru: {} {} деактивирована.

source: {} {} has`t been found in ECP VeiL. Switched to FAILED.
ru: {} {} не найдена на ECP VeiL. Переключена в статус с ошибкой.

source: Group {} has been deleted.
ru: Группа {} удалена.

source: Soft_delete exception: {}.
ru: Ошибка удаления: {}.

source: There is no pool with id: {}.
ru: Отсутствует пул с id: {}.

source: User {} has no VM on pool {}.
ru: У пользователя {} нет виртуальной машины в пуле {}.

source: Ws write error.
ru: Ошибка записи WS.

source: Redis task waiting exception.
ru: Ошибка redis-задачи.

source: Field "{}" - {}.
ru: Поле "{}" - {}.

source: {} is connected: {}.
ru: {} подключен: {}.

source: Resource monitor can`t connect to controller {}.
ru: Монитор ресурсов не может подключиться к контроллеру {}.

source: Closing ws connection {}.
ru: Закрываем WS соединение {}.

source: {cls}: connected controllers -- {controllers}.
ru: {cls}: подключенные контроллеры -- {controllers}.

source: {}: Started.
ru: {}: Запущен.

source: {cls}: Controller {name} is already monitored.
ru: {cls}: Контроллер {name} уже отслеживается.

source: {cls}: resource monitor for controller {name} connected.
ru: {cls}: монитор ресурсов для контроллера {name} подключен.

source: Can`t launch task.
ru: Нет такого задания.

source: Task failed to start.
ru: Не удалось запустить задачу.

source: Task '{}' started.
ru: Задача '{}' начала выполнение.

source: Task '{}' finished successfully.
ru: Задача '{}' завершилась успешно.

source: Task '{}' cancelled.
ru: Задача '{}' отменена.

source: Task '{}' failed.
ru: Задача '{}' завершилась с ошибками.

source: Creation of pool {}.
ru: Создание пула {}.

source: Pool Creation cancelled.
ru: Создание пула отменено.

source: Failed to init pool.
ru: Ошибка инициализации пула.

source: Expanding of pool {}.
ru: Расширение пула {}.

source: Automatic recreation of VM {} in the guest pool.
ru: Автоматическое пересоздание ВМ {} в гостевом пуле.

source: VM creating error.
ru: Ошибка создания ВМ.

source: Decreasing of pool {}.
ru: Уменьшение пула {}.

source: Deleting of pool {}.
ru: Удаление пула {}.

source: Preparation of vm {}.
ru: Подготовка ВМ {}.

source: Another task works on this VM.
ru: ВМ заблокирована выполнением другой задачи.

source: ECP VeiL domain request error.
ru: Ошибка запроса ВМ на ECP VeiL.

source: Task has`t been created.
ru: Задача не была создана.

source: VM remote access task {} for VM {} finished with error.
ru: Задача {} удаленного доступа к ВМ {} завершилась с ошибкой.

source: Backup of {}.
ru: Бэкап {}.

source: Wrong entity type.
ru: Неверный тип сущности.

source: Removal of VMs from pool {}.
ru: Удаление ВМ из пула {}.

source: Template change for pool {}.
ru: Изменение шаблона для пула {}.

source: VM {} is powered. Please shutdown this.
ru: ВМ {} включена. Пожалуйста выключите её.

source: VeiL ECP error: {}.
ru: Ошибка запроса ECP VeiL: {}.

source: The template {} change and distribute this changes to thin clones.
ru: Шаблон {} изменен и распространен с изменениями на тонкие клоны.

source: Preparation of VMs in pool {}.
ru: Подготовка ВМ в пуле {}.

source: Synchronization of AD group {group.verbose_name}.
ru: Синхронизация группы AD {group.verbose_name}.

source: No such Authentication Directory.
ru: Такая Authentication Directory отсутствует.

source: Keep vms on task error.
ru: Сохранить ВМ при ошибке задачи.

source: Synchronize vm data task error.
ru: Ошибка задачи синхронизации данных виртуальной машины.

source: Action upon user disconnect completed. Action: {}. VM: {}. Result: {}.
ru: Действие при отключении пользователя завершено. Действие: {}. ВМ: {}. Результат: {}.
