Repository: jsc-masshtab/vdi-server
Catalog: backend/common/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Vm post disconnect action error.
ru: Ошибка действия ВМ после отключения.

source: _do_actions_when_user_disconnects_from_vm error.
ru: Ошибка _do_actions_when_user_disconnects_from_vm.

source: VDI broker stopped.
ru: VDI брокер остановлен.

source: {} instance(s) of VDI broker web application launched on {}.
ru: Веб-приложение брокера VDI запущено в {} экземпляре(ах) на машине {}.

source: Authentication system is disabled.
ru: Система аутентификации выключена.

source: The license is expired on {}. Some functions will be blocked. Contact your dealer.
ru: Лицензия истекла на машине {}. Некоторые функции будут заблокированы. Свяжитесь с вашим поставщиком.

source: DEBUG mode is enabled.
ru: Режим отладки включен.

source: Authentication directory URL should start with ldap(s)://.
ru: Ссылка на службу каталогов должна начинаться с ldap(s)://.

source: Verbose name should not be empty.
ru: Имя не должно быть пустым.

source: Value should be 1-63 latin characters, -, . or _.
ru: Значение должно быть в диапазоне от 1-63 латинских символа, -, . или _.

source: users count not much with db count.
ru: Счетчик пользователей не коррелирует с счетчиком БД.

source: groups list is empty.
ru: Список групп пуст.

source: No such mapping.
ru: Нет такого отображения.

source: DC should not be empty.
ru: Класс объекта домена не должен быть пустым.

source: Specify id.
ru: Укажите id.

source: No such group.
ru: Отсутствует такая группа.

source: verbose name must be <= 128 characters.
ru: имя должно быть <= 128 символов.

source: verbose_name is empty.
ru: имя пустое.

source: users list is empty.
ru: список пользователей пуст.

source: Description length must be <= 255 characters.
ru: Описание должно быть <= 255 символам.

source: Group {} already exists.
ru: Группа {} уже существует.

source: Specify Group.id or Group.ad_guid.
ru: Укажите Group.id или Group.ad_guid.

source: Specify Group.id or Group.ad_guid. Not both.
ru: Укажите Group.id или Group.ad_guid. Не оба.

source: Missing request body.
ru: Отсутствует тело запроса.

source: Missing username and password.
ru: Отсутствует имя пользователя и пароль.

source: Missing username.
ru: Отсутствует имя пользователя.

source: Missing password.
ru: Отсутствует пароль.

source: External auth system is disabled. Check broker settings.
ru: Внешняя служба авторизации отключена. Проверьте настройки брокера.

source: PAM or LOCAL auth only. Check broker settings.
ru: Проверьте настройки брокера. Разрешена только pam ИЛИ локальная авторизация.

source: Auth system is disabled. Check broker settings.
ru: Проверьте настройки брокера. Система аутентификации отключена.

source: Authentication failed for user: {}.
ru: Ошибка авторизации пользователя: {}.

source: Missing VeiL Connect version. {base_error_msg}.
ru: Не указана версия VeiL Connect. {base_error_msg}.

source: Version {veil_connect_version} is not supported. {base_error_msg}.
ru: Версия {veil_connect_version} не поддерживается. {base_error_msg}.

source: Thin client limit exceeded.
ru: Превышен лимит тонких клиентов.

source: User {} logged out.
ru: Пользователь {} вышел из системы.

source: Bad extension.
ru: Недопустимое расширение.

source: Fail to open license key file.
ru: Не удалось открыть лицензионный ключ.

source: No such user.
ru: Нет такого пользователя.

source: username must be at least 2 character.
ru: имя пользователя должно быть не менее 2 символов.

source: username must contain letters, digits, _, +, begin from letter and can't contain any spaces.
ru: имя пользователя должно состоять из букв, цифр, _, +, начинаться с буквы и не содержать пробелов.

source: Email {} is already busy.
ru: Email {} занят.

source: Email must contain English characters and/or digits, @ and domain name.
ru: Email должен содержать символы латинского алфавита и/или цифры, иметь @ и домен.

source: First name length must be <= 32 characters.
ru: Имя должно быть <= 32 символов.

source: Last name length must be <= 128 characters.
ru: Фамилия должна быть <= 128 символам.

source: Specify id or username.
ru: Укажите id или имя пользователя.

source: Can not delete administrator account {username}.
ru: Невозможно удалить учетную запись администратора {username}.

source: User {username} was deleted.
ru: Пользователь {username} был удален.

source: Can`t remove permission(s) {} because they are granted to groups of user {}.
ru: Невозможно удалить разрешения {}, так как они выданы группам, в которых состоит пользователь.

source: {} is unreachable on ECP VeiL.
ru: {} недоступен на ECP VeiL.

source: Cant create CD-ROM for powered domain {}.
ru: Невозможно создать CD-ROM для включенной виртуальной машины {}.

source: Creating a CD-ROM on the virtual machine {}.
ru: Создание CD-ROM на виртуальной машине {}.

source: name can`t be empty.
ru: имя не может быть пустым.

source: name `{}` is busy.
ru: имя `{}` уже используется.

source: address can`t be empty.
ru: адресс не может быть пустым.

source: address `{}` is busy.
ru: адресс `{}` уже используется.

source: token can`t be empty.
ru: токен не может быть пустым.

source: Connection to ECP has been failed.
ru: Соединение с ECP не удалось.

source: WebSocket opened.
ru: WebSocket открыт.

source: Message: {}.
ru: Сообщение: {}.

source: WS listener error.
ru: Ошибка сервиса прослушивания WS.

source: Unknown subscription source.
ru: Неизвестный источник подписки.

source: Already subscribed.
ru: Уже подписан.

source: Not subscribed.
ru: Не подписан.

source: Journal is exported.
ru: Журнал экспортирован.

source: No such pool.
ru: Нет такого пула.

source: Pool name must contain only characters, digits and -.
ru: Имя пула должно содержать только буквы, цифры и -.

source: Template name of VM must contain only characters, digits, -. Template name length must be in [{} {}] interval.
ru: Шаблонное имя вм должно содержать только буквы, цифры, -. Длина шаблонного имени должна быть в интервале [{} {}].

source: Initial number of VM must be in {}-{} interval.
ru: Начальное число виртуальных машин должно быть в интервале {}-{}.

source: Reserve size of VMs can not be more than maximal number of Vms.
ru: Резервное число ВМ не может быть больше максимального числа ВМ.

source: Reserve size of VM must be in {}-{} interval.
ru: Резервное число ВМ должно быть в интервале {}-{}.

source: Maximal number of created VM can not be less than initial number of VM.
ru: Максимальное число создаваемых виртуальных машин не должно быть меньше начального числа ВМ.

source: Maximal number of created VM must be in [{} {}] interval.
ru: Максимальное число создаваемых виртуальных машин должно быть в интервале [{} {}].

source: Maximal number of created VMs can not be less than current amount of Vms.
ru: Максимальное число создаваемых виртуальных машин не должно быть меньше текущего числа ВМ.

source: Increase step must be positive and less or equal to total_size.
ru: Шаг увеличения должен быть положительным и меньше или равен общему количеству.

source: Increase step must be less than {}.
ru: Шаг увеличения должен быть меньше {}.

source: Connection type cannot be empty.
ru: Тип подключения не может быть пустым.

source: Vm action timeout must be a positive number.
ru: Время ожидания действия ВМ должно быть положительным числом.

source: Vm disconnect action RECREATE is not allowed for pool type {}.
ru: Действие пересоздания ВМ при отключении не разрешено для пула типа {}.

source: Guest pool must have vm disconnect action RECREATE.
ru: В гостевом пуле должно быть действие пересоздания ВМ при отключении.

source: RDS pool is not allowed to have vm disconnect actions.
ru: Пул RDS не может иметь действия при отключении ВМ.

source: Connection types {} are not supported.
ru: Типы подключения {} не поддерживаются.

source: Vm connection data with id {id_} does not exist.
ru: Данные подключения с id {id_} не существуют.

source: VM is unreachable on ECP VeiL.
ru: ВМ недоступна на ECP VeiL.

source: Pool {} has been restored.
ru: Ошибки пула {} сброшены.

source: Pool {} is in service mode.
ru: Пул {} находится в сервисном режиме.

source: Pool {} is already active.
ru: Пул {} уже активирован.

source: Failed to create static pool {}.
ru: Ошибка создания статического пула {}.

source: rds_vm or rds_vms must be specified
ru: rds_vm или rds_vms должны быть указаны

source: VM {} is already in one of pools.
ru: Виртуальная машина {} уже в одном из пулов.

source: Failed to update static pool {}. Name must be unique.
ru: Ошибка редактирования статического пула {}. Имя должно быть уникальным.

source: Failed to update RDS pool {}. Name must be unique.
ru: Ошибка редактирования пула приложений {}. Имя должно быть уникальным.

source: Can not expand pool {} because it reached its total_size.
ru: Не удается расширить пул {} т.к. достигнут максимальный размер.

source: Another task works on pool {}: {}.
ru: Другая задача выполняется над пулом {}.

source: Increase_step {}.
ru: Шаг расширения пула {}.

source: Expansion of pool {} requested.
ru: Запрошено расширение пула {}.

source: Failed to create pool {}.
ru: Ошибка создания пула {}.

source: Failed to update total_size. Task status is {}. Check journal for more info.
ru: Не удалось обновить максимальный размер. Статус задачи: {}. Проверьте журнал для получения дополнительной информации.

source: Failed to update pool {}. Name must be unique.
ru: Ошибка редактирования пула {}. Имя должно быть уникальным.

source: Settings of pool {} is copied.
ru: Настройки пула {} скопированы.

source: There is no VM {}.
ru: Нет ВМ {}.

source: Impossible to assign more than 1 user to VM {} in guest pool.
ru: Невозможно назначить более 1 пользователя на ВМ {} в гостевом пуле.

source: Provide users list or username.
ru: Укажите список пользователей или имя пользователя.

source: User does not have the right to use pool, which has VM.
ru: У пользователя нет прав на использование пула, которому принадлежит ВМ.

source: Another task works on VM {}.
ru: Другая задача выполняется над ВМ {}.

source: Only VM with Windows OS can be in domain.
ru: Только ВМ на ОС Windows могут находиться в домене.

source: Prohibited creating template from the thin clone.
ru: Запрещено создание шаблона из тонкого клона.

source: Vm {} has converted to template {}.
ru: ВМ {} преобразована в шаблон {}.

source: Vm connection data for vm_id {vm_id} and connection_type {connection_type} already exists.
ru: Данные подключения для vm_id {vm_id} и типа подключения {connection_type} уже существуют.

source: Apache server.
ru: Сервер Apache.

source: Database.
ru: База данных.

source: Monitor worker.
ru: Монитор состояния компонентов.

source: Task worker.
ru: Обработчик задач.

source: Web application.
ru: Веб-приложение.

source: Unable to get services information. {}.
ru: Невозможно получить информацию о сервисах. {}.

source: No services launched.
ru: Никаких сервисов не запущено.

source: Output parsing error. {}.
ru: Ошибка вывода парсинга. {}.

source: Invalid service name {}.
ru: Недействительное название службы {}.

source: Error occurred during service action executing. {}.
ru: Ошибка при выполнении действия сервиса. {}.

source: Executed action {} for service {}.
ru: Выполнено действие {} для сервиса {}.

source: Unable to check status of service {}.
ru: Невозможно проверить статус сервиса {}.

source: Cache is cleared.
ru: Кэш очищен.

source: Pool with id {} does not exist.
ru: Пула с id {} не существует.

source: Failed to generate statistics report.
ru: Ошибка создания отчета статистики.

source: No such task.
ru: Нет такого задания.

source: No such task or status of task {} is not {}.
ru: Нет такого задания или статус задания {} не {}.

source: Task '{} ({})' is requested to be cancelled by user {}.
ru: Задача '{} ({})' запрошена для отмены пользователем {}.

source: No controller with id {}.
ru: Нет контроллера с id {}.

source: Tasks associated with controller {} are requested to be cancelled by user {}.
ru: Задачи, связанные с контроллером {}, запрошены для отменены пользователем {}.

source: User {} requested pools data.
ru: Пользователь {} запросил список пулов.

source: Looking for active RDS Connection Broker.
ru: Поиск активного RDS брокера подключений.

source: No active Remote Desktop Connection Broker found.
ru: Активные RDS брокеры подключений не найдены.

source: Fetching published applications data.
ru: Получение данных об опубликованных приложениях.

source: Unable to get list of published applications. {}.
ru: Невозможно получить список опубликованных приложений. {}.

source: Looking for machine.
ru: Поиск ВМ.

source: The pool is busy. Try again in 1 minute.
ru: Пул занят. Попробуйте снова через 1 минуту.

source: The pool doesn`t have free machines. Try again after 5 minutes.
ru: В пуле нет свободных машин. Повторите попытку через 5 минут.

source: The pool doesn`t have free machines.
ru: В пуле нет свободных машин.

source: Machine is being prepared.
ru: ВМ подготавливается.

source: Connection data resolving (address/port).
ru: Получение данных подключения (адрес/порт).

source: User {} connected to pool {}.
ru: Пользователь {} подключился к пулу {}.

source: The remote controller is unavailable.
ru: Контроллер недоступен.

source: The controller didn`t provide a VM address. Try again in 1 minute.
ru: Контроллер не передал адрес ВМ. Попробуйте снова через 1 минуту.

source: Wrong protocol.
ru: Неверный протокол.

source: Controller did not reply. Check if it is available.
ru: Контроллер не ответил. Проверьте, доступен ли он.

source: Setting time zone.
ru: Настройки временной зоны.

source: Failed to set time zone for vm {}.
ru: Ошибка установки временной зоны для ВМ {}.

source: VM address resolving. Attempt number {}.
ru: Получение адреса ВМ. Попытка номер {}.

source: Pool not found.
ru: Пул не найден.

source: The pool doesnt support connection type {}.
ru: Пул не поддерживает тип соединения {}.

source: User {} executed action {} on VM {}.
ru: Пользователь {} выполнил действие {} над ВМ {}.

source: User {} failed to execute action {} on VM {}.
ru: Пользователю {} не удалось выполнить действие {} над ВМ {}.

source: Message can not be empty.
ru: Сообщение не может быть пустым.

source: Wrong message format.
ru: Неправильны формат сообщения.

source: Ws: on_message: error.
ru: Ws: on_message: ошибка.

source: VM {} is not registered in VDI broker.
ru: ВМ {} не зарегистрирована в брокере VDI.

source: No connection information with id {}.
ru: Нет информации о подключении с id {}.

source: All connections.
ru: Все подключения.

source: Connection id: {}.
ru: id подключения: {}.

source: Connections of user: {}.
ru: Подключения пользователя {}.

source: Thin client disconnect requested.
ru: Запрошено отключение тонкого клиента.

source: User {} does not exist.
ru: Не существует пользователя {}.

source: Missing connection spice data.
ru: Пропущены данные для spice соединения.

source: Missing connection vnc data.
ru: Пропущены данные для vnc соединения.
