Repository: jsc-masshtab/vdi-server
Catalog: backend/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Stopping Tornado VDI
ru: Остановка Tornado VDI

source: Stopping redis
ru: Остановка redis

source: Stopping resources_monitor_manager
ru: Остановка менеджера мониторинга ресурсов

source: Stopping GINO
ru: Остановка GINO

source: Stopping IOLoop
ru: Остановка IOLoop

source: Tornado VDI stopped
ru: Tornado VDI остановлен

source: Tornado VDI started
ru: Tornado VDI запущен

source: Auth is disabled. Enable on production!
ru: Используйте выключенную авторизацию только в режиме отладки!

source: The license is expired. Some functions will be blocked. Contact your dealer.
ru: Лицензия истекла. Некоторые функции будут недоступны.

source: License status: {}, expiration time: {}, thin clients limit: {}
ru: Статус лицензии: {}, дата истечения: {}, лимит тонких клиентов: {}

source: No such Authentication Directory.
ru: Отсутствует такая директория авторизации.

source: Authentication directory URL should start with ldap(s)://.
ru: Ссылка на директорию авторизации должна начинаться с ldap(s)://.

source: Verbose name should not be empty.
ru: Имя verbose не должно быть пустым.

source: users count not much with db count.
ru: Счетчик пользователей не коррелирует с счетчиком БД.

source: groups list is empty.
ru: Список групп пуст.

source: No such mapping.
ru: Нет такого отображения.

source: Specify id.
ru: Укажите ID.

source: Authentication directory
ru: Директория авторизации

source: In authentication directory {} mapping
ru: В директории авторизации {} отображение

source: More than one authentication directory can not be created.
ru: Не может быть создано более одной директории авторизации.

source: Authentication directory {} is created
ru: Директория авторизации {} создана

source: Id: {}. Arguments: {}
ru: Id: {}. Аргументы: {}

source: {} {} had remove.
ru: Выполнено удаление: {} {}.

source: Soft_delete exception: {}
ru: Ошибка удаления: {}

source: Arguments: {} of group: {}
ru: Аргументы: {} группы: {}

source: Mapping for auth directory {} is created
ru: Отображение для директории авторизации {} создано

source: New arguments: {} of group: {}
ru: Новые аргументы: {} группы: {}

source: Authentication directory server {} is down.
ru: Сервер директории авторизации {} не работает.

source: Authentication directory server {} is connected
ru: Сервер директории авторизации {} подключен

source: Username must be a string.
ru: Имя пользователя должно быть строкой.

source: Assigning veil groups to {}
ru: Присвоение групп veil {}

source: Mappings: {}
ru: Отображения: {}

source: Role VM_OPERATOR has assigned to user {}.
ru: Пользователю {} назначена роль VM_OPERATOR.

source: escaped values: {}
ru: cкрытые значения: {}

source: role mapping value type: {}
ru: nип значений отображения роли: {}

source: User veil groups: {}
ru: Группы пользователей veil: {}

source: Attaching user {} to group: {}
ru: Прикрепление пользователя {} к группе {}

source: No authentication directory controllers.
ru: Переданная запись отсутствует в системе.

source: Invalid credentials (ldap): {}
ru: Неверные учетные данные (ldap): {}

source: Server down (ldap).
ru: Сервер не отвечает (ldap).

source: No such group.
ru: Отсутствует такая группа.

source: verbose name must me <= 128 characters.
ru: verbose name должен быть <= 128 символов

source: verbose_name is empty.
ru: verbose name пустое.

source: users list is empty.
ru: список пользователей пуст.

source: Last name length must be <= 255 characters.
ru: Фамилия должна быть <= 255 символам.

source: Group
ru: Группа

source: Missing request body
ru: Отсутствует тело запроса

source: Missing username and password
ru: Отсутствует имя пользователя и пароль

source: Missing username
ru: Отсутствует имя пользователя

source: Missing password
ru: Отсутствует пароль

source: Invalid credentials
ru: Неверные полномочия

source: Authentication failed: {err}
ru: Ошибка авторизации {err}

source: for user {username}
ru: для пользователя {username}

source: User {} logout with token {}
ru: Пользователь {} вышел из системы с токеном {}

source: Demo version
ru: Демонстрационная версия

source: Bad extension.
ru: Недопустимое расширение.

source: Fail to open license key file.
ru: Не удалось открыть лицензионный ключ.

source: Try to upload invalid license key
ru: Неудачная попытка загрузить лицензионный ключ

source: Valid license key is uploaded
ru: Лицензионный ключ загружен

source: Role {} is added to user {}
ru: Роль {} назначена пользователю {}

source: User {} roles: {}
ru: Роли пользователя {}: {}

source: Role {} is assigned to user {}
ru: Роль {} назначена пользователю {}

source: Roles: {} was deleted to user {}
ru: Роли: {} удалены у пользователя {}

source: Group {} is removed for user {}
ru: Группа {} удалена у пользователя {}

source: User {username} has been activated.
ru: Пользователь {username} активирован.

source: There is no more active superuser.
ru: Больше нет активного суперпользователя.

source: User {username} has been deactivated.
ru: Пользователь {username} деактивирован.

source: Password of user {username} has been changed.
ru: Пароль пользователя {username} изменен.

source: User {} created with role {}.
ru: Пользователь {} создан с ролью {}.

source: Roles: {}
ru: Роли: {}

source: User {username} has become a superuser.
ru: Пользователь {username} стал суперпользователем.

source: User {username} has left a superuser.
ru: Пользователь {username} перестал быть суперпользователем.

source: Values of user {} is changed
ru: Параметры пользователя {} изменены

source: {auth_type}: user {username} has been logged in successfully. IP: {ip}.
ru: {auth_type}: пользователь {username} успешно зарегистрирован. IP: {ip}.

source: User {username} has logged out.
ru: Пользователь {username} вышел из системы.

source: Group {} is created.
ru: Группа {} создана.

source: Values of group {} is updated
ru: Параметры группы {} обновлены

source: User {} has been included to group {}.
ru: Пользователь {} был включен в группу {}.

source: User {} is already in group {}
ru: Пользователь {} уже находится в группе {}

source: Removing user {} from group {}
ru: Удаление пользователя {} из группы {}

source: Role {} has been set to group {}.
ru: Роль {} добавлена в группу {}.

source: Group {} has already role {}
ru: Группе {} уже назначена роль {}.

source: Roles: {} was deleted to group {}
ru: Роли: {} удалены из группы {}

source: No such user.
ru: Нет такого пользователя.

source: username must contain >= 3 chars (letters, digits, _, -, +) and can't contain any spaces
ru: username должно быть >= 3 символов (буквы, цифры, _, -, +) и не содержать пробелов

source: Email {} is already busy
ru: Email {} уже используется

source: Email must contain English characters and/or digits, @ and domain name.
ru: Email должен содержать символы латинского алфавита и/или цифры, иметь @ и домен.

source: First name length must be <= 32 characters.
ru: Имя должно быть <= 32 символов.

source: Last name length must be <= 128 characters.
ru: Фамилия должна быть <= 128 символам.

source: Scpecify id or username.
ru: Укажите ID или имя пользователя.

source: Token invalid.
ru: Недействительный токен.

source: Token expired.
ru: Срок действия токена истек.

source: jwtauth: Assertion error {}
ru: jwtauth: ошибка утверждения {}.

source: Error with JWT decode
ru: Ошибка JWT декодирования.

source: invalid header authorization
ru: недействительный заголовок авторизации

source: Missing Authorization header
ru: Пропущен заголовок авторизации

source: Controller {} connection error
ru: Ошибка подключения к контроллеру {}

source: Controller {} connection error.
ru: Ошибка подключения к контроллеру {}.

source: URL not found
ru: URL не найден

source: Can't process Content-Type.
ru: Не может обработаться Content-Type.

source: Only 'json' Content-Type.
ru: Content-Type только 'json'.

source: 'body' index in args must be 4, but in the same time 'body' in kwargs
ru: Индекс 'body' это 4 параметра в аргументах. Но в то же время 'body' в kwargs.

source: Can check only kwargs or args. Not both at the same time.
ru: Можете проверить только kwargs или аргументы. Не оба обдовременно.

source: The parameters to be checked are in an dict. Can't explicitly match values with tuple.
ru: Параметры, которые нужно проверить, указаны в формате словаря. Значения не могут явно сопоставиться с кортежем.

source: Value {} is invalid. Valid values are: {}
ru: Значение {} неверно. Допустимые значения: {}

source: Parameter {} is necessary.
ru: Параметр {} необходим.

source: Parameter {} value {} is invalid. Valid values are: {}
ru: Параметр {} значения {} неверный. Допустимые значения: {}

source: IP: {}. username: {}
ru: IP: {}. Пользователь: {}.

source: Invalid permissions
ru: Недостаточно прав

source: Controller is not available.
ru: Контроллер недоступен.

source: Unable to logon to system using these credentials.
ru: Не удалось войти в систему с предоставленными учетными данными.

source: 401: Unauthorized.
ru: Ошибка 401: проблема с авторизацией.

source: Critical controller error.
ru: Критическая ошибка контроллера.

source: Field "{}" - {}
ru: Поле "{}" - {}

source: Auth failed.
ru: Ошибка авторизации.

source: No such controller
ru: Нет такого контроллера.

source: Checking controller credentials: address: {}, username: {}, ldap_connection: {}
ru: Проверка учетных данных контроллера: адрес: {}, имя: {}, ldap_connection: {}

source: Controller {} check failed.
ru: Проверка контроллера {} не удалась.

source: Controller check: {}
ru: Проверка контроллера: {}

source: Controller {} check passed successful.
ru: Проверка контроллера {} прошла успешно.

source: Get controller credentials: Controller's {} credentials are good.
ru: Получение учетных данных контроллера: Хорошие учетные данные контроллера {}.

source: Successfully added new controller {} with address {}.
ru: Успешно добавлен новый контроллер {} с адресом {}.

source: Can't connect to controller {} with username: {}, ldap_connection: {}
ru: Не подключается к контроллеру {} с именем: {}, ldap_connection: {}

source: Can't login login to controller {}
ru: Не получается войти на контроллер {}

source: Successfully update controller {} with address {}.
ru: Успешно обновлен контроллер {} с адресом {}.

source: Controller has pool of virtual machines. Please completely remove.
ru: У контроллера есть пулы виртуальных машин. Выполните полное удаление.

source: Controller {name} had completely remove.
ru: Выполнено полное удаление контроллера {name}.

source: Controller {} has been activated.
ru: Контроллер {} активирован.

source: Controller {} has been deactivated.
ru: Контроллер {} деактивирован.

source: Controller name cannot be empty.
ru: Имя контроллера не может быть пустым.

source: Add new controller with address {address}: operation failed.
ru: Ошибка добавления нового контроллера с адресом {address}.

source: No such controller.
ru: Нет такого контроллера.

source: Fail to update controller {id}: {error}
ru: Ошибка обновления контроллера {id}: {error}

source: Controller
ru: Контроллер

source: The sort parameter is incorrect
ru: Неверный параметр сортировки

source: Incorrect sort parameter {}
ru: Неверный параметр сортировки {}

source: Incorrect request parameter {}
ru: Неверный параметр запроса {}

source: No such event.
ru: Нет такого события.

source: Journal is clear.
ru: Журнал очищен.

source: Incorrect sorting option {}.
ru: Неверный параметр сортировки {}.

source: User {} has been included to pool {}
ru: Пользователь {} был включен в пул {}

source: Pool already has permission.
ru: Пул уже имеет разрешение.

source: Removing user {} from pool {}
ru: Удаление пользователя {} из пула {}

source: Group {} has been included to pool {}
ru: Группа {} была включена в пул {}

source: Removing group {} from pool {}
ru: Удаление группы {} из пула {}

source: Role {} has been set to pool {}.
ru: Роль {} добавлена в пул {}.

source: Pool already has role.
ru: Пул уже имеет роль.

source: Roles: {} was deleted to pool {}
ru: Роли: {} удалены в пуле {}

source: Controller {} not found.
ru: Контроллер {} не найден.

source: Pool has VMs. Please completely remove.
ru: У пула виртуальных машин есть виртуальные машины. Выполните полное удаление.

source: Complete removal pool of desktops {verbose_name} is done.
ru: Выполнено полное удаление пула рабочих столов {verbose_name}.

source: Pool {} has been activated.
ru: Пул {} активирован.

source: Pool {} has been deactivated.
ru: Пул {} деактивирован.

source: HttpError: {}
ru: Ошибка Http: {}

source: VM with id {} not found in any controllers
ru: Виртуальная машина с {} ID не найдена ни на одном из известных контроллеров

source: StaticPool: Check that all vms are on the same node
ru: Статический пул: Убедитесь, что все виртуальные машины находятся на одном узле

source: StaticPool: Create Pool
ru: Статический пул: создание пула

source: StaticPool: Create StaticPool
ru: Статический пул: создание статического пула

source: StaticPool: Create VMs
ru: Статический пул: создание виртуальных машин

source: VM info {}
ru: Информация о ВМ {}

source: VM {} created.
ru: ВМ {} создана.

source: Static pool {} created.
ru: Статический пул {} создан.

source: Static pool {} is updated.
ru: Статический пул {} обновлен.

source: Create Pool {}
ru: Создание пула {}

source: Create AutomatedPool {}
ru: Создание автоматического пула {}

source: Update Pool values for AutomatedPool {}
ru: Обновление значений пула для автоматического пула {}

source: Update AutomatedPool values for {}
ru: Обновление значений автоматического пула для {}

source: Automated pool {name} updated.
ru: Автоматический пул {name} обновлен.

source: add_domain {}, attempt № {}, of {}
ru: Добавление домена {}, попытка № {} из {}

source: VM creation task id: {}
ru: ID задачи создания виртуальной машины: {}

source: Fail to create VM on ECP. Re-run.
ru: Ошибка создания виртуальной машины на ECP. Перезапустите.

source: Subscribe to ws messages.
ru: Подпишитесь на сообщения ws.

source: Wait for result.
ru: Ожидайте результата.

source: Create virtual machine
ru: Создание виртуальной машины.

source: Could not get the response about result of creation VM on ECP by WS. Task status check.
ru: Не удалось получить ответ о результате создания ВМ на ECP по WS. Проверим статус задачи.

source: Probably task is not done. Check VM status.
ru: Вероятно, задание не выполнено. Проверьте состояние ВМ.

source: VM {} is added to Automated pool {}
ru: Виртуальная машина добавлена в автоматический пул {}

source: Error with create VM {} was {} times.
ru: Ошибка с созданием виртуальной машины {} была {} раз.

source: Add {} initial vms for pool {}. Controller address: {}
ru: Добавление {} начальных виртуальных машин для пула {}. Адрес контроллера: {}.

source: Pool {} os type is: {}
ru: Операционная система пула {}: {}

source: Automated pool creation started
ru: Автоматическое создание пула началось

source: Created {} VMs from {} at the Automated pool {}
ru: Создание {} виртуальных машин из {} автоматического пула {}

source: Can't create VM
ru: Невозможно создать виртуальную машину

source: Initial VM amount {} at the Automated pool {}
ru: Начальное количество виртуальных машин {} в автоматическом пуле {}

source: Automated pool created with errors. VMs created: {}. Required: {}
ru: Автоматический пул создан с ошибками. Созданные виртуальные машины: {}. Необходимо: {}.

source: Could not create the required number of machines.
ru: Не удалось создать необходимое количество машин.

source: VM creating error:
ru: Ошибка создания виртуальной машины:

source: Delete VMs for AutomatedPool {}
ru: Удаление виртуальных машин для автоматического пула {}

source: Calling soft delete for vm {}
ru: Вызов мягкого удаления для виртуальной машины {}

source: VM
ru: Виртуальная машина

source: Logic error: no such pool
ru: Логическая ошибка: нет такого пула

source: No such pool.
ru: Нет такого пула.

source: ip-address probably invalid.
ru: Возможно, неверный IP адрес.

source: Pool name must contain only characters, digits, _, -
ru: Имя пула должно содержать только буквы, цифры, _, -

source: Template name of VM must contain only characters, digits, _, -
ru: Шаблонное имя вм должно содержать только буквы, цифры, _, -

source: Initial number of VM must be in {}-{} interval
ru: Начальное число виртуальных машин должно быть в интервале {}-{}.

source: Number of created VM must be in {}-{} interval
ru: Число создаваемых виртуальных машин должно быть в интервале {}-{}.

source: Maximal number of created VM should be less than initial number of VM
ru: Максимальное число создаваемых виртуальных машин не должно быть меньше начального числа ВМ

source: Maximal number of created VM must be in [{} {}] interval
ru: Максимальное число создаваемых виртуальных машин должно быть в интервале [{} {}].

source: Pool
ru: Пул

source: StaticPool: Get additional info from Veil
ru: Статический пул: получение дополнительной информации о Veil

source: All of VM must be at one server
ru: Все виртуальные машины должны быть на одном сервере

source: StaticPool: Determine cluster
ru: Статический пул: Определение кластера

source: VM has no disks.
ru: ВМ не имеет дисков.

source: Failed to create static pool {}.
ru: Ошибка создания статического пула {}.

source: List of VM should not be empty
ru: Список виртуальных машин не должен быть пустым.

source: VM ids: {}
ru: ID виртуальных машин: {}

source: VM {} is at server different from pool server now
ru: ВМ {} находится на сервере отличном от сервера пула.

source: VM {} is already in one of pools
ru: Виртуальная машина {} уже в одном из пулов.

source: All VMs on node: {}
ru: Все виртуальные машины на узле: {}

source: Vm {} is added to pool {}
ru: Виртуальная машина {} добавлена в пул {}

source: VM doesn't belong to specified pool
ru: Виртуальная машина не принадлежит заданному пулу

source: Failed to update static pool {}. Name must be unique.
ru: Ошибка редактирования статического пула {}. Имя должно быть уникальным.

source: Failed to create automated pool {}. Name must be unique.
ru: Ошибка создания автоматического пула {}. Имя должно быть уникальным.

source: Maximal number of created VM can not be reduced.
ru: Максимальное количество создаваемых виртуальных машин не может быть уменьшено.

source: Failed to update automated pool {}. Name must be unique.
ru: Ошибка редактирования автоматического пула {}. Имя должно быть уникальным.

source: destructor VdiFrontWsHandler
ru: Деструктор VdiFrontWsHandler

source: Message: {}
ru: Сообщение: {}

source: Unknown subscription source
ru: Неизвестный источник подписки

source: already subscribed
ru: уже подписан

source: not subscribed
ru: не подписан

source: WebSocket closed
ru: WebSocket закрыт

source: Write error
ru: Ошибка записи

source: {} is connected: {}
ru: {} подключен: {}

source: {cls}: an not connect to {ip}
ru: {cls}: не подключен к {ip}.

source: add {}
ru: добавление {}

source: {} Closing ws connection {}
ru: {} Закрытие ws соединения {}

source: {cls}: connected controllers -- {controllers}
ru: {cls}: подключенные контроллеры -- {controllers}.

source: {}: Started
ru: {}: Запущен

source: {cls}: Controller {ip} is already monitored!
ru: {cls}: Контроллер {ip} уже отслеживается!

source: {cls}: resource monitor for controller {ip} connected
ru: {cls}: монитор ресурсов для контроллера {ip} подключен

source: {cls}: controller {ip} is not monitored!
ru: {cls}: контроллер {ip} не отслеживается!

source: {cls}: resource monitor for controller {ip} removed
ru: {cls}: удален монитор ресурсов для контроллера {ip}

source: Invalid credentials (ldap)
ru: Неверные учетные данные (ldap)

source: Thin client limit exceeded.
ru: Превышен лимит тонких клиентов.

source: Pool not found.
ru: Пул не найден.

source: User does not have permission to use pool.
ru: Пользователь не имеет разрешения на использование пула.

source: Pool has not free machines
ru: В пуле нет свободных машин

source: VM does not support RDP
ru: Виртуальная машина не поддерживает RDP

source: User {} not found.
ru: Пользователь {} не найден.

source: There is no pool with id: {}
ru: Отсутствует пул с ID: {}.

source: User {} has no VM on pool {}
ru: У пользователя {} нет виртуальной машины в пуле {}

source: Create VM {} on VDI DB.
ru: Создание виртуальной машины {} на VDI DB.

source: VM {} is created
ru: Виртуальная машина {} создана

source: Fail to remove VM {} from ECP:
ru: Ошибка удаления ВМ {} из ECP:

source: Vm {} removed from ECP.
ru: ВМ {} удалена из ECP.

source: User {} is added to VM {}
ru: Пользователь {} назначен виртуальной машине {}

source: Vm already has permission.
ru: Вм уже имеет разрешение

source: VM {} is clear from users
ru: ВМ {} освобождена от пользователей

source: Trying to create VM on ECP with verbose_name={}
ru: Попытка создать виртуальную машину на ECP с verbose_name = {}

source: Request to create VM sent without surprise. Leaving while.
ru: Запрос на создание ВМ отправлен без неожиданностей. Покидаем while.

source: ECP error: {}
ru: Ошибка ECP: {}

source: Bad domain name {}
ru: Неверное доменное имя {}

source: Controller has not free space for creating new VM.
ru: На контроллере отсутствует место для создания новой виртуальной машины.

source: Not enough free space on data pool
ru: Недостаточно свободного места в пуле данных

source: Possibly blocked by active task on ECP. Wait before next try.
ru: Возможно, заблокировано активным заданием на ECP. Подождите перед следующей попыткой.

source: Something went wrong. Interrupt while.
ru: Что-то пошло не так. Прерываем while.

source: Wait one more try
ru: Подождите еще одну попытку.

source: Vm {} removed from pool
ru: ВМ {} удалена из пула

source: There is no VM {}
ru: Нет ВМ {}.

source: User does not have the right to use pool, which has VM.
ru: У пользователя нет прав на использование пула, которому принадлежит ВМ.

source: GraphQL: Resolving template info
ru: GraphQL: разрешение информации о шаблоне.

source: Template data could not be retrieved: {}
ru: Не удалось получить данные Шаблона: {}

source: VM data could not be retrieved: {}
ru: Не удалось получить данные виртуальной машины: {}

source: Templates list could not be retrieved: {}
ru: Не удалось получить список шаблонов: {}

source: Incorrect sort parameter
ru: Неверный параметр сортировки

source: GraphQL: Resolving VMs
ru: GraphQL: разрешение виртуальных машин

source: VMs list could not be retrieved: {}
ru: Не удалось получить список виртуальных машин: {}

source: GraphQL: VM type list:
ru: GraphQL: список типов виртуальных машин:
